[{
    "name": "Thengai Poornam Kozhukattai / Ukadiche Modak Recipe With Rice Flour",
    "url": "https://www.archanaskitchen.com/thengai-poornam-kozhukattai-ukadiche-modak-recipe-with-rice-flour",
    "img":"http://www.awesomecuisine.com/content_images/1/modak.jpg",
    "yield": "Makes: 12 modaks",
    "ingredients": [
      "1 cup Rice flour",
      "2 cups Water",
      "1 teaspoon Cooking oil",
      "1/2 teaspoon Salt",
      "1 cup Fresh coconut , grated",
      "1/2 cup Jaggery",
      "1 teaspoon Cardamom Powder"
    ],
    "instructions": [
      "In a heavy bottomed sauce pan; combine all the ingredients on high heat until the jaggery is dissolved completely.",
      "Turn the heat to medium and keep stirring until the mixture thickens and the water begins to evaporate.",
      "It takes about 7-10 minutes for the water to evaporate. Towards the end you will notice the mixtures comes together, with all the water evaporated. The coconut filling will now look like sticky mixture.",
      "At this stage, turn off the heat and transfer the mixture to another bowl to cool. Once cool divide the mixture into 10-15 equal portions. This will be the sweet filling for the modak wrapper.",
      "Bring the water to a boil in a pan along with the salt and oil.",
      "Gradually add little rice flour at time and keep stirring till the mixture comes together.",
      "Turn off the heat and transfer the rice flour mixture to another bowl and cover with a muslin cloth.",
      "With a little oil in a cup, smear the oil in your hands and knead the dough well to remove any lumps. At all times make sure keep the dough covered with a wet muslin cloth to prevent the dough from drying out.",
      "Take a lemon size portion of the dough, make into a ball and press the dough in the palm of your hands to make a flat dough, cup your palms a bit so it forms a depression in the center.",
      "Place the jaggery filling in the center and bring the edges of the dough together to the center with a pointed top as shown in the image above. Continue the similar process with the remaining portions of the dough and coconut filling",
      "Note: Keep dipping and smearing your fingers and palms with sesame oil when you handle a new portion of the dough. This will prevent the dough from sticking to your hands",
      "Prepare the steamer filled with water. Place the filled dumplings in the steamer plate and into the steamer. Steam for about 10 minutes until the dumplings look shiny and smooth. You will also notice that if it is not cooked, the rice wrapper will be sticky.",
      "Once they are steamed, the Kozhukattai (Ukadiche Modaks) are ready for an offering to god for the festival of Ganesh Chaturthi. You can also have this steamed dumpling as your Tea TIme Snack."
    ],
    "totalTime": {
      "iso": "PT40M",
      "en": "40 minutes"
    },
    "prepTime": {
      "iso": "PT10M",
      "en": "10 minutes"
    },
    "cookTime": {
      "iso": "PT30M",
      "en": "30 minutes"
    }
  }, {
    "name": "Punjabi Mixed Vegetable Kadai Recipe",
    "url": "https://www.archanaskitchen.com/punjabi-mixed-vegetable-kadai-recipe",
    "img":"http://www.yummyoyummy.com/wp-content/uploads/2015/08/Kadai-vegetables3.jpg",
    "yield": "Makes: 4 Servings",
    "ingredients": [
      "1/4 cup Potatoes (aloo) , length wise",
      "1/4 cup Baby corn , length wise",
      "1/4 cup Carrot , length wise",
      "1/4 cup Green beans (French Beans) , length wise",
      "1/4 cup Cauliflower (gobi) , chopped",
      "1 tablespoon Green peas (Matar)",
      "2 Green Bell Pepper (Capsicum) , diced",
      "2 Onion , (1 diced +1 chopped)",
      "1 Bay leaf (tej patta)",
      "1 teaspoon Cumin seeds",
      "1 teaspoon Garam masala powder , optional",
      "1 teaspoon Kasuri Methi (Dried Fenugreek Leaves)",
      "1/2 teaspoon Turmeric powder (Haldi)",
      "1/4 teaspoon Sugar",
      "Salt , to taste",
      "2 tablespoons Fresh cream",
      "2 tablespoons Butter , + Oil mixed",
      "2 Tomatoes",
      "1 Onion , 1 onion",
      "1/4 inch Ginger",
      "2 Green Chillies",
      "3 cloves Garlic",
      "1-1/2 tablespoon Coriander seeds",
      "3 Dry red chilli , adjustable",
      "1/2 inch Cinnamon Stick",
      "2 cloves Cloves",
      "2 Cardamom (Pods /Seeds)"
    ],
    "instructions": [
      "To begin making the Punjabi Mixed Vegetable Kadai recipe, Clean, wash and cut all the veggies. Keep it aside. Meanwhile, dice onions and capsicums.",
      "Blanch the cut veggies in hot water for 8-10 minutes to speed the cooking process .",
      "The next step is to make the onion tomato paste. Heat oil in a heavy bottomed pan and add the ingredients under 'to saute and grind' and saute till tomatoes turns little mushy.",
      "Cool down and grind it a fine paste.",
      "The next step is to make the Kadai Masala. Dry roast coriander seeds, red chillies, cinnamon, cloves and elaichi until they turn slightly brown and starts releasing the aroma.",
      "Cool them and grind it in a mixer to a coarse powder.",
      "Heat butter in a kadai. Add cumin seeds and bay leaf. Let cumin seeds splutter. Add onion and saute till slightly browned.",
      "Next add the tomato paste and saute well for about 4-5 minutes or till raw smell goes and color changes.",
      "Meanwhile, as the tomato onion paste is getting cooked take another pan add a little oil, roast capsicum, and onion for 2 minutes. Set aside.",
      "Once the raw smell of the tomato onion paste goes and they start leaving oil, add turmeric powder, kasoori methi, kadai masala, garam masala, salt and sugar. Cook for another 2 minutes.",
      "Add sauted capsicum and onion. When the gravy starts giving a nice aroma, and the consistency is semi thick, add in the blanched veggies and mix well. Cover and cook for 2-3 minutes.",
      "Finally add in fresh cream and give a quick mix. Boil once, add chopped coriander leaves and switch off.",
      "Serve Punjabi Mixed Vegetable Kadai along with Palak Raita and Phulka for your everyday meal."
    ],
    "totalTime": {
      "iso": "PT35M",
      "en": "35 minutes"
    },
    "prepTime": {
      "iso": "PT20M",
      "en": "20 minutes"
    },
    "cookTime": {
      "iso": "PT15M",
      "en": "15 minutes"
    }
  },

  {
    "name": "Roasted Tomato And Mozzarella Caprese Salad With Basil Balsamic Vinegar Recipe",
    "url": "https://www.archanaskitchen.com/roasted-tomato-and-mozzarella-caprese-salad-with-basil-balsamic-vinegar-recipe",
    "img":"http://www.seriouseats.com/recipes/assets_c/2013/12/122313-278218-Serious-Eats-Hearty-SAlads-Oven-Roasted-Tomato-CapreseB-thumb-625xauto-374642.jpg",
    "yield": "Makes: 2 Servings",
    "ingredients": [
      "6 Tomatoes",
      "100 grams Mozzarella cheese",
      "10 Basil leaves , chopped",
      "1 sprig Rosemary",
      "5 cloves Garlic",
      "1/2 teaspoon Lemon juice",
      "1/2 teaspoon Black pepper powder",
      "1 teaspoon Paprika powder",
      "2 Tablespoon Balsamic Vinegar",
      "2 teaspoon Extra Virgin Olive Oil",
      "Sea salt , to taste"
    ],
    "instructions": [
      "To begin making the Roasted Tomato And Mozzarella Caprese Salad With Basil Balsamic Vinegar recipe, at the very beginning marinate the tomato halves in 1/2 teaspoon of oil, salt, pepper, paprika, brown sugar, basil and lemon juice for 10 minutes.",
      "Cut the cheese into 5 thick slices. Meanwhile heat oil in a roasted pan and add garlic, fry for a minute.",
      "Arrange the tomatoes in circles on the pan, insert cheese slices in between tomatoes with gaps, lay the rosemary sprig on top.",
      "Drizzle balsamic vinegar. Cook till the cheese melts and tomatoes are done for about 8 minutes approximately.",
      "Check for salt and pepper seasoning. Serve hot on plate.",
      "Serve Roasted Tomato And Mozzarella Caprese Salad With Basil Balsamic Vinegar along with French Onion Soup for weekday dinner."
    ],
    "totalTime": {
      "iso": "PT15M",
      "en": "15 minutes"
    },
    "prepTime": {
      "iso": "PT5M",
      "en": "5 minutes"
    },
    "cookTime": {
      "iso": "PT10M",
      "en": "10 minutes"
    }
  }, {
    "name": "Raw Mango Prawns Curry Recipe",
    "url": "https://www.archanaskitchen.com/raw-mango-prawns-curry-recipe",
    "img":"http://maunikagowardhan.co.uk/wp-content/uploads/2016/01/Keralan-Prawn-Curry.jpg",
    "yield": "Makes: 4 Servings",
    "ingredients": [
      "500 grams Prawns , de shelled",
      "1 Mango (Raw) , diced",
      "1 Cardamom (Pods /Seeds)",
      "1 inch Cinnamon Stick",
      "1 inch Ginger , chopped",
      "4 cloves Garlic , chopped",
      "1 teaspoon Turmeric powder (Haldi)",
      "1 teaspoon Red chilli powder",
      "1 teaspoon Vinegar",
      "1 Lemon juice",
      "1 cup Coconut milk",
      "1 Onion , chopped",
      "1/2 cup Fresh coconut",
      "2 sprig Curry leaves"
    ],
    "instructions": [
      "To begin making the Raw Mango Prawns Curry Recipe, we will first marinate the prawns with turmeric powder and lemon juice.",
      "Grind the ingredients mentioned in the list to a smooth paste by adding some water. Once done keep it aside.",
      "Heat a kadai with oil, add all the whole spice into the hot oil. Add ginger and garlic chopped and saute until it softens.",
      "Add ground paste and saute until the raw smell goes away. You can add the marinated prawns and raw mango and mix it along with the masala.",
      "Add coconut milk, along with salt, chilli powder, vinegar and bring it to a boil. You can add water to the curry and adjust the consistency.",
      "Boil the curry for 10 minutes in low heat and serve hot.",
      "Serve the Raw Mango Prawns Curry Recipe along with steamed rice, Urulaikizhangu Puli Thokku Recipe by the side to enjoy your meal."
    ],
    "totalTime": {
      "iso": "PT30M",
      "en": "30 minutes"
    },
    "prepTime": {
      "iso": "PT5M",
      "en": "5 minutes"
    },
    "cookTime": {
      "iso": "PT25M",
      "en": "25 minutes"
    }
  }
]
